---
kind: other
id: Methods.T:Autodesk.Revit.UI.RibbonButton
source: html/83cb5858-3658-f751-35e5-95d3262d407f.htm
---
# RibbonButton Methods

Determines whether the specified Object is equal to the current Object .